InformationRegisters/umk_ДопРеквизитыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>umk_ДопРеквизитыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БлокироватьВыписку</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БлокироватьПроизводство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДокументаУК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДокументаУК1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДокументаУК2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьКодС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУК1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУК2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУК</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУК1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУК2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонечныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонечныйСрок1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонечныйСрок2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримСтр1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПримСтр2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КодыСинхронизацииУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>КодыСинхронизацииУНФ</Name>
			<Comment>Вспомогательный регистр необходимый для обмена кодами с конфигурацией УНФ</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыУказанияСкладовВТабличнойЧастиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВариантыУказанияСкладовВТабличнойЧастиДокументов</Name>
			<Comment>(Общ.)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляДокументовПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляДокументовРеализации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляДокументовПоступленияРеализации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бартерный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС14</Name>
					<Comment>(Общ) Ставка НДС 14%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/УдостоверениеКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УдостоверениеКачества</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаУдостоверенияКачества</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.umk_ФормаУдостоверенияКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеКонтрагента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ХранилищеДополнительнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ХранилищеДополнительнойИнформации</Name>
			<Comment>Хранилище дополнительной информации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДанных</Name>
					<Comment>Вид данных</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительнойИнформацииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланируемоеПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.УдостоверениеКачества</v8:Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.КонструкторУдостоверенияКачества</v8:Type>
						<v8:Type>cfg:DocumentRef.УвольнениеИзОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СпецификацияКДоговору</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияВходящегоНалоговогоДокумента</v8:Type>
						<v8:Type>cfg:DocumentRef.КадровоеПеремещениеОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HTTPServices/umk_UNF_exchange/Ext/Module.bsl
Функция QualityCertificateGET(Запрос)
	
	КодУзла = Запрос.ПараметрыURL["node"]; 
	Стутус = Запрос.ПараметрыURL["status"]; 
	
	Узел = ПланыОбмена.umk_ПланОбменаУНФ.НайтиПоКоду(КодУзла);
	
	Если Не ЗначениеЗаполнено(Узел) Тогда
		Возврат Новый HTTPСервисОтвет(404)
	КонецЕсли;
	
	Если  Стутус = "success" Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Метаданные.Документы.УдостоверениеКачества);
		Возврат  Новый HTTPСервисОтвет(200)
	Иначе         		
		ArrayDocs  = Новый Массив;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Узел", Узел);
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ХранилищеДополнительнойИнформации.Хранилище,
		|	ХранилищеДополнительнойИнформации.Ссылка,
		|	УдостоверениеКачестваИзменения.Ссылка КАК УдостоверениеКачества,
		|	УдостоверениеКачестваИзменения.Ссылка.Дата КАК Дата,
		|	УдостоверениеКачестваИзменения.Ссылка.Номер КАК Номер
		|ИЗ
		|	Документ.УдостоверениеКачества.Изменения КАК УдостоверениеКачестваИзменения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
		|		ПО УдостоверениеКачестваИзменения.Ссылка = ХранилищеДополнительнойИнформации.Объект
		|ГДЕ
		|	НЕ ХранилищеДополнительнойИнформации.ПометкаУдаления
		|	И УдостоверениеКачестваИзменения.Узел = &Узел
		|	И УдостоверениеКачестваИзменения.Ссылка.Проведен";
		
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			HeaderStructure = Новый Структура("DocDate, DocNumber", Выборка.Дата, Выборка.Номер);
			
			
			Данные = Выборка.Хранилище.Получить();
			
			Попытка
				Данные.Записать(КаталогВременныхФайлов() + "\UK_Table.mxl");
			Исключение
				Возврат Новый HTTPСервисОтвет(404);
			КонецПопытки;
			
			ArrayLines = Новый Массив; 
			Таблица = Новый ТабличныйДокумент;
			Таблица.Прочитать(КаталогВременныхФайлов() + "\UK_Table.mxl");
			
			Для Инд = 1 По Таблица.ВысотаТаблицы Цикл
				Расшифровка = СокрЛП(Таблица.Область(Инд, 2).Расшифровка);
				Если Расшифровка <> "" Тогда
					SyncCode = ПолучитьКодСинхронизации(Расшифровка, Выборка.Дата); 
					LineStructure = Новый Структура();
					LineStructure.Вставить("SyncCode",SyncCode);
					LineStructure.Вставить("CertDate",ПреобразоватьВДату(Таблица.Область(Инд, 9).Текст)); 
					ArrayLines.Добавить(LineStructure);				
				КонецЕсли; 
			КонецЦикла;
			
			УдалитьФайлы(КаталогВременныхФайлов() + "\UK_Table.mxl");	
			
			DataStructure = Новый Структура("Header,Lines",HeaderStructure,ArrayLines);
			
			ArrayDocs.Добавить(DataStructure);
			
		КонецЦикла;
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ArrayDocs);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
		Возврат Ответ;
		
	КонецЕсли;
	
	
КонецФункции

Функция ПреобразоватьВДату(ДатаСтрока)
	
	Попытка 
		Дата = Дата(Прав(ДатаСтрока,4) + Сред(ДатаСтрока,4,2) + Лев(ДатаСтрока,2) + "000000");
	Исключение
		Дата = '00010101000000';
	КонецПопытки;
	
	Возврат Дата
	
КонецФункции

Функция PeriodicValuesNomenclatureGET(Запрос)
	
	КодУзла = Запрос.ПараметрыURL["node"]; 
	Стутус = Запрос.ПараметрыURL["status"]; 
	product_code = Запрос.ПараметрыURL["product_code"];
	
	Узел = ПланыОбмена.umk_ПланОбменаУНФ.НайтиПоКоду(КодУзла);
	
	Если Не ЗначениеЗаполнено(Узел) Тогда
		Возврат Новый HTTPСервисОтвет(404)
	КонецЕсли;
	
	Если  Стутус = "success" Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Метаданные.Справочники.Номенклатура);
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Метаданные.РегистрыСведений.umk_ДопРеквизитыНоменклатуры);
		Возврат  Новый HTTPСервисОтвет(200)
	Иначе         		
		DataArray  = Новый Массив;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Узел", Узел);
		Запрос.УстановитьПараметр("product_code", product_code);
		
		Если product_code = "null" Тогда
			Текст = 
			"ВЫБРАТЬ
			|	ДопРеквизитыНоменклатурыСрезПоследних.ЕстьКодС КАК SyncCode,
			|	ДопРеквизитыНоменклатурыСрезПоследних.БлокироватьВыписку КАК BlockStatement,
			|	ДопРеквизитыНоменклатурыСрезПоследних.Номенклатура.НаименованиеПолное КАК FullName,
			|	ДопРеквизитыНоменклатурыСрезПоследних.КодСинхронизации КАК Code
			|ИЗ
			|	Справочник.Номенклатура.Изменения КАК НоменклатураИзменения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.umk_ДопРеквизитыНоменклатуры.СрезПоследних КАК ДопРеквизитыНоменклатурыСрезПоследних
			|		ПО НоменклатураИзменения.Ссылка = ДопРеквизитыНоменклатурыСрезПоследних.Номенклатура
			|ГДЕ
			|	НоменклатураИзменения.Узел = &Узел";
		Иначе  //отбор по номенклатуре
			Текст = 
			"ВЫБРАТЬ
			|	ДопРеквизитыНоменклатурыСрезПоследних.ЕстьКодС КАК SyncCode,
			|	ДопРеквизитыНоменклатурыСрезПоследних.БлокироватьВыписку КАК BlockStatement,
			|	ДопРеквизитыНоменклатурыСрезПоследних.Номенклатура.НаименованиеПолное КАК FullName,
			|	ДопРеквизитыНоменклатурыСрезПоследних.КодСинхронизации КАК Code
			|ИЗ
			|	РегистрСведений.umk_ДопРеквизитыНоменклатуры.СрезПоследних КАК ДопРеквизитыНоменклатурыСрезПоследних
			|ГДЕ
			|	ДопРеквизитыНоменклатурыСрезПоследних.КодСинхронизации = &product_code";
		КонецЕсли;
		
		Запрос.Текст = Текст;
		
		
		Табл = Запрос.Выполнить().Выгрузить();
		Табл.Свернуть("Code,SyncCode,BlockStatement,FullName");
		
		Для Каждого СтрокаТабл Из Табл Цикл			
			
			DataStructure = Новый Структура("Code,SyncCode,BlockStatement,FullName");
			ЗаполнитьЗначенияСвойств(DataStructure, СтрокаТабл);
			
			DataArray.Добавить(DataStructure);
			
		КонецЦикла;
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, DataArray);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
		Возврат Ответ;
		
	КонецЕсли;
	
КонецФункции

Функция LoadInvoicePOST(Запрос)
	
	POST_txt =Запрос.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(POST_txt);
	Объект_JSON = ПрочитатьJSON(ЧтениеJSON);  
	ЧтениеJSON.Закрыть();

	HeaderStructure = Объект_JSON.HeaderStructure;
	датаф2 =  ПрочитатьДатуJSON(HeaderStructure.Date, ФорматДатыJSON.ISO);
	ЕДРПОУ = СокрП(HeaderStructure.FiscalCode);
	НомерФ2 = HeaderStructure.Number;
	КатЦенФ2 = HeaderStructure.PriceType;
	ПодразделениеКод = СокрЛП(HeaderStructure.subdivisionCode);
	
	ДатаЗаказаКлиентаФ2 =  ПрочитатьДатуJSON(HeaderStructure.CustomerOrderDate, ФорматДатыJSON.ISO);
	НомерЗаказаКлиентаФ2 = HeaderStructure.CustomerOrderNumber;
	ДатаДоставкиКлиентаФ2 =  ПрочитатьДатуJSON(HeaderStructure.CustomerShipmentDate, ФорматДатыJSON.ISO);
	
	МассивСтрокТовары =  Объект_JSON.TableProducts;
	
	//Создадим документ расходная накладная.
	//user - admin

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.umk_номерФ2 = &номерФ2
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(датаф2));
	Запрос.УстановитьПараметр("номерФ2", НомерФ2);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(датаф2));
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		ДокОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		мВалютаРегламентированногоУчета   = глЗначениеПеременной("ВалютаРегламентированногоУчета");
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокОбъект, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, "Продажа");	
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ДокОбъект, глЗначениеПеременной("глТекущийПользователь"));
	КонецЕсли;
	
	ИмяТабЧасти = "Товары";
	
	мУказаниеСкладов = глЗначениеПеременной("УказаниеСкладовВТабличнойЧастиДокументов");
	мУказаниеСкладовВТЧ = (мУказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации)
	Или (мУказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовРеализации);
	
	//ТипЦены = Константы.umk_ТипЦеныПриИмпорте.Получить();
	//НомерКолЦены = ?(ТипЦены = 1, 5, 4);
	
	ДокОбъект.Дата = датаф2;
	ДокОбъект.umk_КатЦенФ2 = КатЦенФ2;
	ДокОбъект.Организация = Константы.umk_ГоловнаяОрганизация.Получить();
	 
	ДокОбъект.umk_НомерЗаказаФ2  = НомерЗаказаКлиентаФ2; 
	ДокОбъект.umk_ДатаЗаказаФ2   = ДатаЗаказаКлиентаФ2;
	ДокОбъект.umk_ДатаДоставкиФ2 = ДатаДоставкиКлиентаФ2;
	ДокОбъект.umk_номерФ2 = НомерФ2;
	ДокОбъект.umk_Импортирована = Истина;
	ДокОбъект.СуммаВключаетНДС = Ложь;
	ДокОбъект.АвторасчетНДС = Истина;
	ДокОбъект.УчитыватьНДС = Истина;
	ДокОбъект.Подразделение = Справочники.Подразделения.НайтиПоКоду(ПодразделениеКод);
	
	//Счета учета по умолчанию 
	ДокОбъект.СчетУчетаРасчетовСКонтрагентом    = ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПокупателями;
	ДокОбъект.СчетУчетаРасчетовПоАвансам        = ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымВНациональнойВалюте;
	
	ДокОбъект.СчетУчетаНДС 				        = ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваНеподтвержденные;
	ДокОбъект.СчетУчетаНДСПодтвержденный        = ПланыСчетов.Хозрасчетный.НалоговыеОбязательства;
	

	
	ПлательщикНДС = Истина;
	
	Если ЗначениеЗаполнено(ЕДРПОУ) Тогда
		КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ", ЕДРПОУ);
		Если Не КонтрагентСсылка.Пустая() Тогда
			
			ДокОбъект.Контрагент = КонтрагентСсылка;
			
			Организация = ПолучитьОрганизациюИзДоговораКонтрагента(КонтрагентСсылка, Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			
			Если ЗначениеЗаполнено(Организация) Тогда
				
				ДокОбъект.Организация = Организация;
				
				СхемаНО = ОбщегоНазначения.ПолучитьСхемуНалогообложения(ДокОбъект.Дата, ДокОбъект.Организация);
				
				Если НЕ СхемаНО.Ссылка = Справочники.СхемыНалогообложения.ЕдиныйНалогИНДС
					И Не СхемаНО.Ссылка = Справочники.СхемыНалогообложения.НалогНаПрибыльИНДС ТОгда
					ПлательщикНДС = Ложь;
					ДокОбъект.УчитыватьНДС =Ложь;
				КонецЕсли;
				
			КонецЕсли;

			// Выполняем общие действия для всех документов при изменении Контрагент.
			мСтруктураПараметровДляПолученияДоговора = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи();
			ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ДокОбъект, мСтруктураПараметровДляПолученияДоговора);
			
			//Установим счета учера расчетов
			СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом(ДокОбъект.Организация, ДокОбъект.Контрагент, ДокОбъект.ДоговорКонтрагента);
			
			Если ДокОбъект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
				ДокОбъект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
				ДокОбъект.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;
			ИначеЕсли ДокОбъект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
				ДокОбъект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателяПриБартере;
				ДокОбъект.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателяПриБартере;
			Иначе
				ДокОбъект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
				ДокОбъект.СчетУчетаРасчетовПоАвансам     = СчетаУчета.СчетАвансовПокупателя;
			КонецЕсли;
			
			ДокОбъект.СчетУчетаРасчетовПоТаре          = СчетаУчета.СчетУчетаТарыПокупателя;
			ДокОбъект.СчетУчетаРасчетовПоТареПоАвансам = СчетаУчета.СчетАвансовПоТареПокупателя;
			ДокОбъект.СчетУчетаНДС 					 = СчетаУчета.СчетУчетаНДСПродаж;
			ДокОбъект.СчетУчетаНДСПодтвержденный  	 = СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
		КонецЕсли;
	КонецЕсли;
	
	ДокОбъект.Товары.Очистить();
	
	Для Каждого СтрокаТовары Из МассивСтрокТовары Цикл
		
		СтрокаТабличнойЧасти = ДокОбъект.Товары.Добавить();
		
		Номенклатура = umk_Доработки.НоменклатураПоКодуСинхронизации(СокрП(СтрокаТовары.code), ДокОбъект.Дата);
		ЕдИзмер = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(СтрокаТовары.Unit, Истина, , Номенклатура);
		
		СтрокаТабличнойЧасти.Номенклатура = Номенклатура;
		// Характиристика номенклатуры
		Если  ЗначениеЗаполнено(СтрокаТовары.PackName) И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
			
			 СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.НайтиПоРеквизиту("umk_КодУпаковки",СтрокаТовары.PackCode,,СтрокаТабличнойЧасти.Номенклатура);
			
		КонецЕсли;
		//Конец Характеристика
		
		Если Не ЗначениеЗаполнено(ЕдИзмер) Тогда
			 ЕдИзмер = Номенклатура.ЕдиницаХраненияОстатков;
		КонецЕсли;
		 
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокОбъект);
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = ЕдИзмер;
		ОбработкаТабличныхЧастей.ПриИзмененииЕдиницыТабЧасти(СтрокаТабличнойЧасти, ДокОбъект); 	
		СтрокаТабличнойЧасти.СтавкаНДС = ?(ПлательщикНДС, Перечисления.СтавкиНДС.НДС20,Перечисления.СтавкиНДС.БезНДС);
		
		УчетСерийныхНомеров.ПроверитьСерийныеНомера(СтрокаТабличнойЧасти, ДокОбъект);
		
		//ЗаполнитьСчетаУчетаВСтрокеТабЧасти
		ДокОбъект.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, ИмяТабЧасти, Истина, Истина); 
		
		// Ввод состава набора
		УправлениеЗапасами.ДобавитьСоставНабора(СтрокаТабличнойЧасти, ДокОбъект);
		СтрокаТабличнойЧасти.Цена =  ?(ПлательщикНДС, 
		            СтрокаТовары.Price/(1 +(УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС))/100),
					           СтрокаТовары.Price);
		
		
		СтрокаТабличнойЧасти.Количество = СтрокаТовары.Quantity;
		// Рассчитать реквизиты табличной части.
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокОбъект);
		
		// Рассчитать реквизиты табличной части.
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДокОбъект);
		
		//Доп. значения 
		// запись в регистр сроки годности.
		ЕдСрокаГодности = СтрокаТовары.ExpiryDate;  
		СрокГодности =  СтрокаТовары.UnitTime;
		Если  ЗначениеЗаполнено(СрокГодности) И ЗначениеЗаполнено(ЕдСрокаГодности) Тогда
			ПараметрыСрокаГодности = Новый Структура("ВидСрокаГодности,СрокГодности",ЕдСрокаГодности,СрокГодности);
			umk_Доработки.СоздатьЗаписьСрокГодности(СтрокаТабличнойЧасти ,ПараметрыСрокаГодности);
		КонецЕсли;
		
		//упаковка на печать
		СтрокаТабличнойЧасти.umk_УпаковкаНаПечать = СтрокаТовары.PackPrintName;

		//код клиента
		СтрокаТабличнойЧасти.umk_КодКлиента = СтрокаТовары.ClientCode;
		
		//штрихкод номенклатуры
		Если ЗначениеЗаполнено(СтрокаТовары.Barcode) Тогда
			umk_Доработки.НовыйШтрихкод(СтрокаТабличнойЧасти, СтрокаТовары.Barcode); 
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		ДокОбъект.Записать();
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Возврат Ответ;		
	КонецПопытки;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

Функция LoadReturnableInvoicePOST(Запрос)
	
	POST_txt =Запрос.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(POST_txt);
	Объект_JSON = ПрочитатьJSON(ЧтениеJSON);  
	ЧтениеJSON.Закрыть();

	HeaderStructure = Объект_JSON.HeaderStructure;
	датаф2 =  ПрочитатьДатуJSON(HeaderStructure.Date, ФорматДатыJSON.ISO);
	ЕДРПОУ = СокрП(HeaderStructure.FiscalCode);
	НомерФ2 = HeaderStructure.Number;
	КатЦенФ2 = HeaderStructure.PriceType;
	ПодразделениеКод = СокрЛП(HeaderStructure.subdivisionCode);
	
		
	МассивСтрокТовары =  Объект_JSON.TableProducts;
	
	//Создадим документ возвратная накладная.
	//user - admin

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателя.Ссылка
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
		|ГДЕ
		|	ВозвратТоваровОтПокупателя.umk_номерФ2 = &номерФ2
		|	И ВозвратТоваровОтПокупателя.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(датаф2));
	Запрос.УстановитьПараметр("номерФ2", НомерФ2);
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(датаф2));
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		ДокОбъект = Документы.ВозвратТоваровОтПокупателя.СоздатьДокумент();
		мВалютаРегламентированногоУчета   = глЗначениеПеременной("ВалютаРегламентированногоУчета");
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ДокОбъект, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, "Продажа");	
		ОбщегоНазначения.ЗаполнитьОбязательныеРеквизитыШапкиНовогоДокумента(ДокОбъект, глЗначениеПеременной("глТекущийПользователь"));
	КонецЕсли;
	
	ДокОбъект.УчитыватьНДС     = Истина;
	ДокОбъект.СуммаВключаетНДС = Ложь;
	
	// Заполним склад 
	Если Не ЗначениеЗаполнено(ДокОбъект.СкладОрдер) Тогда
		ДокОбъект.СкладОрдер = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойСклад");	
	КонецЕсли;
	
	ИмяТабЧасти = "Товары";
	
	мУказаниеСкладов = глЗначениеПеременной("УказаниеСкладовВТабличнойЧастиДокументов");
	мУказаниеСкладовВТЧ = (мУказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовПоступленияРеализации)
	Или (мУказаниеСкладов = Перечисления.ВариантыУказанияСкладовВТабличнойЧастиДокументов.ДляДокументовРеализации);
	
	//ТипЦены = Константы.umk_ТипЦеныПриИмпорте.Получить();
	//НомерКолЦены = ?(ТипЦены = 1, 5, 4);
	
	ДокОбъект.Дата = датаф2;
	ДокОбъект.Подразделение = Справочники.Подразделения.НайтиПоКоду(ПодразделениеКод);
	ДокОбъект.Организация  = Константы.umk_ГоловнаяОрганизация.Получить(); 
	ДокОбъект.umk_номерФ2 = НомерФ2;
	ДокОбъект.umk_Импортирована = Истина;
	
	//Счета учета по умолчанию 
	ДокОбъект.СчетУчетаРасчетовСКонтрагентом    = ПланыСчетов.Хозрасчетный.РасчетыСОтечественнымиПокупателями;
	ДокОбъект.СчетУчетаРасчетовПоАвансам        = ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученнымВНациональнойВалюте;
	
	ДокОбъект.СчетУчетаНДС 				        = ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваНеподтвержденные;
	ДокОбъект.СчетУчетаНДСПодтвержденный        = ПланыСчетов.Хозрасчетный.НалоговыеОбязательства;
		
	
	ПлательщикНДС = Истина;
	
	Если ЗначениеЗаполнено(ЕДРПОУ) Тогда
		КонтрагентСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ", ЕДРПОУ);
		Если Не КонтрагентСсылка.Пустая() Тогда
			
			ДокОбъект.Контрагент = КонтрагентСсылка;
			Организация = ПолучитьОрганизациюИзДоговораКонтрагента(КонтрагентСсылка, Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			
			Если ЗначениеЗаполнено(Организация) Тогда
				
				ДокОбъект.Организация = Организация;
				
				СхемаНО = ОбщегоНазначения.ПолучитьСхемуНалогообложения(ДокОбъект.Дата, ДокОбъект.Организация);
				
				Если НЕ СхемаНО.Ссылка = Справочники.СхемыНалогообложения.ЕдиныйНалогИНДС
					И Не СхемаНО.Ссылка = Справочники.СхемыНалогообложения.НалогНаПрибыльИНДС ТОгда
					ПлательщикНДС = Ложь;
					ДокОбъект.УчитыватьНДС = Ложь;
				КонецЕсли;
				
			КонецЕсли;

			
			// Выполняем общие действия для всех документов при изменении Контрагент.
			мСтруктураПараметровДляПолученияДоговора = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи();
			ЗаполнениеДокументов.ПриИзмененииЗначенияКонтрагента(ДокОбъект, мСтруктураПараметровДляПолученияДоговора);
			
			//Установим счета учера расчетов
			СчетаУчета = УправлениеВзаиморасчетами.ПолучитьСчетаРасчетовСКонтрагентом( ДокОбъект.Организация,  ДокОбъект.Контрагент,  ДокОбъект.ДоговорКонтрагента);
			
			Если ДокОбъект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером Тогда
				ДокОбъект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
			ИначеЕсли ДокОбъект.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Бартерный Тогда
				ДокОбъект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателяПриБартере;
			Иначе
				ДокОбъект.СчетУчетаРасчетовСКонтрагентом = СчетаУчета.СчетРасчетовПокупателя;
			КонецЕсли;
			
			ДокОбъект.СчетУчетаРасчетовПоАвансам     = ДокОбъект.СчетУчетаРасчетовСКонтрагентом;
			
			ДокОбъект.СчетУчетаРасчетовПоТаре          = СчетаУчета.СчетУчетаТарыПокупателя;
			ДокОбъект.СчетУчетаРасчетовПоТареПоАвансам =  ДокОбъект.СчетУчетаРасчетовПоТаре;
			ДокОбъект.СчетУчетаНДС 					 = СчетаУчета.СчетУчетаНДСПродаж;
			ДокОбъект.СчетУчетаНДСПодтвержденный  	 = СчетаУчета.СчетУчетаНДСПродажПодтвержденный;
			
		КонецЕсли;
	КонецЕсли;
	
	ДокОбъект.Товары.Очистить();
	
	Для Каждого СтрокаТовары Из МассивСтрокТовары Цикл
		
		СтрокаТабличнойЧасти = ДокОбъект.Товары.Добавить();
		НомерНакладной = СтрокаТовары.InvoiceNumber;
		
		ДокументРТиУ = Документы.ВозвратТоваровОтПокупателя.ДокументРеализацииПоНомеру77(НомерНакладной, ДокОбъект.Контрагент);
		
		Если ЗначениеЗаполнено(ДокументРТиУ) Тогда //Найдем номенклатуру по коду на дату РТиУ
			Номенклатура =  umk_Доработки.НоменклатураПоКодуСинхронизации(СтрокаТовары.Code, ДокументРТиУ.Дата);
			СтрокаТабличнойЧасти.ДокументПартии = ДокументРТиУ;
		Иначе // на дату документа
			Номенклатура =  umk_Доработки.НоменклатураПоКодуСинхронизации(СтрокаТовары.Code, ДокОбъект.Дата);
		КонецЕсли; 
		
		ЕдИзмер = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(СтрокаТовары.Unit, Истина, , Номенклатура);
		
		СтрокаТабличнойЧасти.Номенклатура = Номенклатура;
		
		//Документ Партия и НН 
		ДатаНакладной = ПрочитатьДатуJSON(СтрокаТовары.InvoiceDate, ФорматДатыJSON.ISO);
		ПолучитьДокументПартииДляВН(СтрокаТабличнойЧасти, ДатаНакладной, НомерНакладной, ДокОбъект.Контрагент,ПлательщикНДС);
		
		// Характиристика номенклатуры
		Если  ЗначениеЗаполнено(СтрокаТовары.PackName) И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) Тогда
			
			СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.НайтиПоРеквизиту("umk_КодУпаковки",СтрокаТовары.PackCode,,СтрокаТабличнойЧасти.Номенклатура);
			
		КонецЕсли;
		//Конец Характеристика
		
		Если Не ЗначениеЗаполнено(ЕдИзмер) Тогда
			 ЕдИзмер = Номенклатура.ЕдиницаХраненияОстатков;
		КонецЕсли;
		 
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, ДокОбъект);
		СтрокаТабличнойЧасти.ЕдиницаИзмерения = ЕдИзмер;
		ОбработкаТабличныхЧастей.ПриИзмененииЕдиницыТабЧасти(СтрокаТабличнойЧасти, ДокОбъект); 
		
		СтрокаТабличнойЧасти.СтавкаНДС = ?(ПлательщикНДС, Перечисления.СтавкиНДС.НДС20,Перечисления.СтавкиНДС.БезНДС);
		СтрокаТабличнойЧасти.Качество = Справочники.Качество.Новый;
		
		//ЗаполнитьСчетаУчетаВСтрокеТабЧасти
		ДокОбъект.ЗаполнитьСчетаУчетаВСтрокеТабЧасти(СтрокаТабличнойЧасти, ИмяТабЧасти, Истина, Истина); 
		
		СтрокаТабличнойЧасти.Цена =  ?(ПлательщикНДС, 
		            СтрокаТовары.Price/(1 +(УчетНДС.ПолучитьСтавкуНДС(СтрокаТабличнойЧасти.СтавкаНДС))/100),
					           СтрокаТовары.Price);
		СтрокаТабличнойЧасти.Количество = СтрокаТовары.Quantity;
		
		// Рассчитать реквизиты табличной части.
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТабличнойЧасти, ДокОбъект);
		//
		// Рассчитать реквизиты табличной части.
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, ДокОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ДокОбъект);
		
		//Накладная основание
		//СтрокаТабличнойЧасти.ДокументПартии = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(СтрокаТовары.InvoiceNumber,
		//                                         ПрочитатьДатуJSON(СтрокаТовары.InvoiceDate, ФорматДатыJSON.ISO));		
		////Доп. значения 		
		//упаковка на печать
		СтрокаТабличнойЧасти.umk_УпаковкаНаПечать = СтрокаТовары.PackPrintName;
			
	КонецЦикла;
	
	Попытка
		ДокОбъект.Записать();
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Возврат Ответ;		
	КонецПопытки;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

//Вернуть коды синхронизации на текущую дату тех позиций для которых они стали равными ""
//
Функция AllCodesSyncNomenGET(Запрос)
	
	КодУзла = Запрос.ПараметрыURL["node"]; 
	Стутус = Запрос.ПараметрыURL["status"]; 
	
	Узел = ПланыОбмена.umk_ПланОбменаУНФ.НайтиПоКоду(КодУзла);
	
	Если Не ЗначениеЗаполнено(Узел) Тогда
		Возврат Новый HTTPСервисОтвет(404)
	КонецЕсли;
	
	Если  Стутус = "success" Тогда
		
		ПланыОбмена.УдалитьРегистрациюИзменений(Узел, Метаданные.РегистрыСведений.КодыСинхронизацииУНФ);
		Возврат  Новый HTTPСервисОтвет(200)
		
	Иначе         		
		
		DataArray  = Новый Массив;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Узел", Узел);
		Запрос.УстановитьПараметр("Период", ТекущаяДата());
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КодыСинхр.Код КАК code_sync
		|ИЗ
		|	РегистрСведений.КодыСинхронизацииУНФ.Изменения КАК КодыСинхрИзменения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСинхронизацииУНФ.СрезПоследних(&Период, ) КАК КодыСинхр
		|		ПО КодыСинхрИзменения.Номенклатура = КодыСинхр.Номенклатура
		|			И КодыСинхрИзменения.Период = КодыСинхр.Период
		|ГДЕ
		|	КодыСинхр.НовыйКод = """"
		|	И КодыСинхрИзменения.Узел = &Узел";
		
		Табл = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаТабл Из Табл Цикл			
			
			DataStructure = Новый Структура("code_sync");
			ЗаполнитьЗначенияСвойств(DataStructure, СтрокаТабл);
			
			DataArray.Добавить(DataStructure);
			
		КонецЦикла;
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, DataArray);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
		Возврат Ответ;
		
	КонецЕсли;
	
	
КонецФункции

//Вернуть коды синхронизации на текущую дату
//
Функция AllCodesSyncNomenGET_2(Запрос)
	
	DataArray  = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДопРеквизитыНоменклатуры.КодСинхронизации КАК code_sync
		|ИЗ
		|	РегистрСведений.umk_ДопРеквизитыНоменклатуры.СрезПоследних(&Период, ) КАК ДопРеквизитыНоменклатуры
		|ГДЕ
		|	НЕ ДопРеквизитыНоменклатуры.КодСинхронизации = """"";
	
	Табл = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТабл Из Табл Цикл			
		
		DataStructure = Новый Структура("code_sync");
		ЗаполнитьЗначенияСвойств(DataStructure, СтрокаТабл);
		
		DataArray.Добавить(DataStructure);
		
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, DataArray);
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат Ответ;
	
КонецФункции

//вспомогательные процедуры
Процедура ПолучитьДокументПартииДляВН(СтрокаТабличнойЧасти, Дата, Номер, Контрагент, ПлательщикНДС = Истина)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РеализацияТоваровУслуг.Ссылка,
		|	РеализацияТоваровУслуг.Дата КАК Дата
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.umk_номерФ2 = &Номер
		|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ");
	
	Запрос.УстановитьПараметр("ДатаКонца", КонецДня(Дата));
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Номер", Номер);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда	
		ДокументРТиУ = Выборка.Ссылка	
	Иначе
		ДокументРТиУ = Документы.РеализацияТоваровУслуг.ПустаяСсылка();	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументРТиУ) Тогда
		
		СтрокаТабличнойЧасти.ДокументПартии = ДокументРТиУ;		
		
	КонецЕсли;
	
	Если ПлательщикНДС Тогда
		УстановитьНалоговуюНакладную(СтрокаТабличнойЧасти);
	КонецЕсли;
		
КонецПроцедуры

Процедура УстановитьНалоговуюНакладную(СтрокаТабличнойЧасти)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НалоговаяНакладная.Ссылка
		|ИЗ
		|	Документ.НалоговаяНакладная КАК НалоговаяНакладная
		|ГДЕ
		|	НалоговаяНакладная.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", СтрокаТабличнойЧасти.ДокументПартии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтрокаТабличнойЧасти.umk_НалоговаяНакладная = Выборка.Ссылка;
	Иначе
		СтрокаТабличнойЧасти.umk_НалоговаяНакладная = Документы.НалоговаяНакладная.ПустаяСсылка();
	КонецЕсли;
	 
КонецПроцедуры

//Вернуть КодСинхронизации по номенклатуре
Функция ПолучитьКодСинхронизации(КодНоменклатуры, Период)
	
	Попытка
		КодНоменклатуры = Число(КодНоменклатуры);
	Исключение
		КодНоменклатуры = 0;
	КонецПопытки;
	
	КодНоменклатуры = Формат(КодНоменклатуры,"ЧЦ=9; ЧДЦ=0; ЧН=; ЧВН=; ЧГ=");
	
	Номенклатура = Справочники.Номенклатура.НайтиПоКоду(КодНоменклатуры);	
	
	Возврат umk_Доработки.КодСинхронизацииПоНоменклатуре(Номенклатура, Период);
	
КонецФункции

//Получим организацию из договора контрагена
Функция ПолучитьОрганизациюИзДоговораКонтрагента(Контрагент, ВидДоговора)
	
	Запрос = Новый Запрос(	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Организация,
	|	ДоговорыКонтрагентов.Номер КАК Номер,
	|	ДоговорыКонтрагентов.Дата КАК Дата
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ,
	|	Номер УБЫВ");
	
	//Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий()Тогда
		Возврат Выборка.Организация
	Иначе
		Возврат Константы.umk_ГоловнаяОрганизация.Получить();
	КонецЕсли;

КонецФункции
